<template>
	<div>
		<el-container class="about-container">
		<el-main>
				  <div class="about-title">DVP社区用户协议</div>
				 <p>欢迎您注册成为DVP社区的用户！在您成为的我们的注册用户前，请务必先仔细阅读、充分理解本协议各条款内容，特别是各方的权利义务、免除或者限制责任的条款、管辖与法律适用条款。如果您未满18周岁，请在法定监护人的陪同下阅读本协议。一旦您完成账号注册，则意味着完全接受并同意本协议项下条款和内容。</p>
				
				<p class="ul-title"><b>一、注册用户的权利</b></p>
				<ul class="first-ul">
				<li>1. 您有权拥有自已在DVP社区的用户名及密码，并有权使用自已的用户名及密码随时登录DVP社区。</li>
				<li>2. 您可以在DVP社区上参与项目漏洞检测。</li>
				<li>3. 您可以在DVP社区上提交以合法途径获取的漏洞、威胁情报。</li>
				<li>4. 您可以根据DVP社区奖励规则获得相应的虚拟币奖励。</li>
				<li>5. 您可以对漏洞审核结果向DVP社区提出异议，DVP社区需给出合理解释。</li>
				<li>6. 您可以查看DVP社区上公布的公开研究数据。</li>
				<li>7. 您的个人信息受到保护，不接受任何个人或单位的查询。国家机关依法查询除外，您设置公开除外。</li>
				</ul>
				<p class="ul-title"><b>二、注册用户的义务</b></p>
				<ul class="first-ul">
				<li>1. 注册用户必须是具备完全民事权利能力和完全民事行为能力的自然人。</li>
				<li>2. 您的账户和密码应由您妥善保管，并正确、安全地使用，因您未能保管好该账户和密码而导致的法律责任由您全部承担。若因为您自身原因，而导致账号、密码遭他人非法使用时，DVP社区不负责处理。您自身原因包括但不限于：任意向第三者透露账号和密码及所有注册资料；多人共享同一个账号；安装非法或来路不明的程序；将已经登陆帐号的设备提供给他人使用等。</li>
				<li>3. 不得擅自转让自己的账户和密码给他人使用。任何通过注册账户编辑、发布的信息或做出的任何行为都被视为是该账户所属用户自己的行为。</li>
				<li>
					4. 必须遵守国家法律、法规及规章，并同意将不会利用DVP社区进行任何违法或不正当的活动，包括但不限于下列行为∶
					<ul class="second-ul">
						<li>
							4.1 上传、发布、传播或以其他方式传送含有下列内容之一的信息：
							<ul class="third-ul">
								<li>4.1.1 反对宪法所确定的基本原则的；</li>
								<li>4.1.2 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一，损害国家荣誉和利益的；</li>
								<li>4.1.3 煽动民族仇恨、民族歧视、破坏民族团结的；</li>
								<li>4.1.4 破坏国家宗教政策，宣扬邪教和封建迷信的；</li>
								<li>4.1.5 散布谣言，扰乱社会秩序，破坏社会稳定的；</li>
								<li>4.1.6 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</li>
								<li>4.1.7 侮辱或者诽谤他人，侵害他人合法权利的；</li>
								<li>4.1.8 含有虚假、有害、胁迫、侵害他人隐私、骚扰、粗俗、猥亵或其他道德上令人反感的内容的；</li>
								<li>4.1.9 含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其他内容的；</li>
							</ul>
						</li>
						<li>
							4.2 不得为任何非法目的而使用DVP社区及DVP社区提供的相关信息：
							<ul class="third-ul">
								<li>4.2.1 不得利用DVP社区进行任何可能对互联网或移动网正常运转造成不利影响的行为；</li>
								<li>4.2.2 不得利用DVP社区提供的网络服务上传、发布或传播虚假、有害、骚扰、粗俗或其他任何非法的信息资料；</li>
								<li>4.2.3 不得侵犯其他任何第三方的专利权、著作权、商标权、名誉权或其他任何合法权益；</li>
								<li>4.2.4 不得利用DVP社区网络服务系统进行任何不利于DVP社区的行为；</li>
							</ul>
						</li>
						<li>
							4.3 不利用DVP社区服务和网站相关信息从事以下活动：
							<ul class="third-ul">
								<li>4.3.1 未经允许，进入计算机信息网络或者使用计算机信息网络资源的；</li>
								<li>4.3.2 未经允许，对计算机信息网络功能进行删除、修改或者增加的；</li>
								<li>4.3.3 未经允许，对进入计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加的；</li>
								<li>4.3.4 故意制作、传播计算机病毒等破坏性程序的；</li>
								<li>4.3.5 其他危害计算机信息网络安全的行为。</li>
								<li>4.3.6 测试行为造成了对机构的攻击行为，包括但不限于数据泄露、数据丢失、服务异常、访问缓慢等；</li>
								<li>4.3.7 测试行为造成了对机构的声誉影响，包括但不限于曝光机构漏洞、勒索机构、倒卖机构数据、利用社会工程学欺骗机构等；</li>
								<li>4.3.8 测试行为造成了对机构的事实性损害，包括但不限于经济损失、名誉损害等。</li>
							</ul>
						</li>
					</ul>
				</li>
				
				<li>5. 不得将相关漏洞通过其他任何形式包括其他平台、线上及线下任何形式载体重复提交、上传或公布。</li>
				<li>6. 自愿接受DVP社区的法律声明。</li>
				<li>7. DVP社区可对本协议随时更新，更新后的协议条款一旦公布即代替原来的协议条款，不再另行通知，用户可在本网站查阅最新版协议条款。在DVP社区修改协议条款后，如果用户不接受修改后的条款，请立即停止使用DVP社区提供的服务，用户继续使用DVP社区提供的服务将被视为接受修改后的协议。</li>
				</ul>
				<p class="ul-title"><b>三、DVP社区的权利义务</b></p>
				<ul class="first-ul">
				<li>1. DVP社区拥有本协议中有关产品及服务的所有权，DVP社区应当负责产品及服务的基本硬件配置和服务器日常硬件维护及故障的排除，并努力提升和改进技术。</li>
				<li>2. DVP社区如发现您有本协议禁止或非法的行为时， DVP社区有权暂停、中断或终止服务，并保留追究您法律责任的权利。</li>
				<li>3. DVP社区有权定期或不定期对服务平台或相关设备进行检修、维护、升级、机房迁移等常规维护，您对DVP社区的前述常规维护工作具有配合支持的义务。如因常规维护造成服务在合理时间内暂停或中断的，DVP社区不承担违约责任。对于您不配合DVP社区完成服务产品升级、机房迁移工作而造成的任何后果，由您自行承担。</li>
				</ul>
				<p class="ul-title"><b>四、违约责任</b></p>
				<ul class="first-ul">
				<li>1. 若DVP社区自行发现或根据相关部门的信息、权利人的投诉等发现，您存在违反有关法律、法规、规章及其他法律规范或协议约定的行为，DVP社区有权根据自己的独立判断采取以下一种或多种措施：
					<ul class="second-ul">
						<li>1.1 要求您立即更换、修改、删除内容；</li>
						<li>1.2 将您列入黑名单；</li>
						<li>1.3 直接删除、屏蔽相关内容或断开链接等；</li>
						<li>1.4 暂停、中断、终止您使用服务；</li>
						<li>1.5 终止协议；</li>
						<li>1.6 追究贵方的法律责任。</li>
					</ul>
				</li>
				<li>2. 服务期间，如主管部门下达涉及您的账户、服务、设备的禁令或类似通知的，DVP社区将配合执行有关指令，在主管部门允许的情况下尽可能及时地通知您。此情况下，DVP社区不承担违约责任。</li>
				<li>3. DVP社区在您违约后继续履行本协议的，不得视为DVP社区对您违约责任的免于追究。DVP社区免予追究您一次或多次未履行本协议义务相关责任的，不得被解释为DVP社区对您任何随后的违反协议或不履行本协议责任的不予追究。</li>
				</ul>
				<p class="ul-title"><b>五、责任范围及责任限制</b></p>
				<ul class="first-ul">
				<li>1. 由于您自身行为所导致或产生的任何处罚、调查、指控、索赔或要求，或由此导致任何损失，均需您自行承担费用解决，并自行承担相应责任。如因您行为导致任何第三方针对DVP社区包括DVP社区的供货商、客户或员工提出任何处罚、调查、指控、索赔或要求，一经收到DVP社区的通知，您应立即承担费用为DVP社区包括DVP社区的供货商、客户或员工提供抗辩并使DVP社区包括DVP社区的供货商、客户或员工免受任何损害。同时DVP社区保留就您的行为给DVP社区导致的损失向您索赔的权利。您应承担的费用包括但不限于赔偿金、罚金、公关费、调查费、差旅费、诉讼费、仲裁费、律师费等。</li>
				</ul>
				
				<p class="ul-title"><b>六、通告</b></p>
				<ul class="first-ul">
				<li>1. 所有致您的通告均可通过网页公告、网页提示、站内信等方式中的一种或多种方式进行传送。其他重要事项均可以此形式进行。</li>
				</ul>
				
				<p class="ul-title"><b>七、其他</b></p>
				<ul class="first-ul">
				<li>1. 本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。</li>
				<li>2. 如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决。</li>
				<li>3. 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。</li>
				<li>4. 本协议解释权及修订权归DVP社区所有。</li>
				</ul>
				<br/><br/>
		</el-main>
	</el-container>
	
	
	</div>
	
</template>

<script>	
	export default {
		name:'agreement',		
		data() {
	      return {
	      	lang: 'zh'
	      }
	   	},
	   	mounted(){
		   this.lang=localStorage.getItem('locale')
		   if(this.lang=='zh'){
		   		this.$router.push({ path: '/agreement' })
		   }else if(this.lang=='en' || this.lang==null || this.lang==''){
		   		this.$router.push({ path: '/agreement_en' })
		   }else if(this.lang=='ko'){
		   		this.$router.push({ path: '/agreement_ko' })
		   }
	    }
	}
</script>

<style>
	.vul_container{
		width: 100%;
		text-align: center;
		display: block;
		padding: 0 10%;
		box-sizing: border-box;
	}
	.vul_container h1{
		font-size: 24px;
	    color: #31412e;
	    line-height: 36px;
	    text-align: center;
	    padding-bottom: 20px;
	}
</style>