<template>
  <el-row :gutter="20">
    <el-col :span="24" style="padding: 0 !important ; float: inherit">
      <div class="container-fluid">
        <div class="row-fluid">
          <!--left-->
          <div class="span3">
            <div id="toc1"></div>
          </div>
          <!--right-->
          <div class="span9 faq1">
            <div class="hero-unit">
              <h1>常见问题</h1>

              <h2>厂商相关</h2>

              <h3>1.&nbsp;为何选择入驻DVP？</h3>

              <p>
                &nbsp;传统安全服务产品主要是用于自动化检测安全问题，有一定的局限性。而在DVP社区，全球白帽子和安全工程师参与测试，并利用攻击者思维，可以从更全面的角度帮助厂商发现安全问题，有效加强相应的漏洞预警和应急响应机制，从而提升区块链整体行业的安全性。
              </p>

              <h3>2.&nbsp;怎样入驻DVP？</h3>
              <p>&nbsp;第一步，注册DVP账号，通过身份审核；</p>

              <p>&nbsp;第二步，支付担保金。发布漏洞悬赏计划。</p>

              <p>&nbsp;第三步，完成入驻。</p>
              <h3>3.&nbsp;注册DVP需要绑定企业邮箱吗？</h3>
              <p>
                &nbsp;需要绑定有效的企业邮箱。用于身份验证以及日后的漏洞通报。且该邮箱不会对外显示及公布。
              </p>

              <h3>4.&nbsp;注册完DVP账号是否表示已入驻？</h3>
              <p>
                &nbsp;注册完DVP账号尚未完成入驻。还有两步未完成，即：支付担保金和发布漏洞悬赏计划，完成这两步后，方可表示已入驻。
              </p>

              <h3>5.&nbsp;什么是担保金？</h3>

              <p>
                &nbsp;厂商发布悬赏时，预存不低于一个严重漏洞的赏金，确保厂商能够有足够的悬赏奖金，用于日后支付漏洞奖励。担保金可以随时退款。
              </p>
              <!-- <p> &nbsp;厂商发布悬赏时，需预先支付不低于50Ether的金额存储在DVP，确保厂商能够有足够的悬赏奖金，用于日后支付漏洞奖励。担保金可以随时退款。</p> -->

              <h3>6&nbsp;什么是白帽子？</h3>

              <p>
                &nbsp;白帽子正面的黑客，能够识别计算机系统或网络系统中的安全漏洞的安全技术专家，但并不会恶意利用该漏洞，而是提交给厂商或者能够找到该厂商的第三方漏洞平台，帮助厂商在被其他人恶意利用之前修补漏洞，维护计算机和互联网安全。
              </p>

              <h3>7.&nbsp;漏洞奖励由谁定价？</h3>

              <p>
                &nbsp;目前，漏洞奖励由DVP的专业漏洞审核人员根据漏洞产生的风险严重性进行相应的定价。具体可参考<a
                  href="http://localhost/rule#奖励标准"
                  class="Vul_rewardReference"
                  >[社区奖励标准]
                </a>
              </p>

              <h3>8.&nbsp;漏洞奖励由谁支付？</h3>

              <p>
                &nbsp;DVP对于接收到的漏洞信息，会按厂商性质做两类处理，分为已经入驻DVP平台的厂商，和非入驻的厂商，对于入驻的厂商，奖励是由厂商进行颁发，同时也意味着厂商拥有该漏洞的最终知识产权，对漏洞的公开与否自行决定，而非入驻的厂商，DVP会有7天的时间留给厂商进行认领，超过7天DVP社区会对漏洞进行奖励由DVP基金进行支付，同时社区会根据漏洞的修复情况，进行公开处理，一旦确认漏洞修复，且该漏洞具备行业漏洞的典型性，DVP会公开该漏洞（公开前会进行脱敏处理），给予行业以及社区成员学习参考。
              </p>

              <!-- <h3>9.&nbsp;DVP收费吗？</h3>

						<p> &nbsp;DVP自身不收取任何费用。厂商用于收集漏洞的全部奖金归白帽子所有。</p> -->

              <h3>9.&nbsp;如何认领漏洞？</h3>

              <p>
                &nbsp;未注册厂商认领漏洞需要注册DVP账户，即可在企业后台查看并处置漏洞。
              </p>

              <div class="jl_div">
                <p>企业认领漏洞操作流程：</p>
                <p>1) 使用厂商邮箱注册账号（无企业邮箱请使用常用邮箱）</p>
                <p>
                  2) 进行身份验证（对企业邮箱进行验证，工作人员1-3天审核完成）
                </p>
                <p>3) 登录厂商账号</p>
                <p>4) 在厂商后台查看漏洞</p>
                <p>5) 查看漏洞细节并点击认领漏洞</p>
              </div>

              <h3>10.&nbsp;如何发布悬赏？</h3>

              <p>
                &nbsp;厂商通过担保金审核后，即可在厂商后台的悬赏管理界面编辑悬赏计划，计划主要包含：
              </p>

              <div class="jl_div">
                <p>1）奖励计划</p>
                <p>2）测试范围</p>
                <p>3）漏洞评级</p>
                <p>4）注意事项</p>
              </div>

              <h3>11.&nbsp;漏洞细节会公开吗？</h3>

              <p>
                &nbsp;DVP会在确保漏洞修复完成的前提下，选择对外公开具备行业典型性的漏洞，并对公开的漏洞进行脱敏处理。
              </p>

              <h3>12.&nbsp;DVP负责修复漏洞吗？</h3>

              <p>&nbsp;DVP不负责修复漏洞，但可联系我们友情进行协助修复。</p>

              <h3>13.&nbsp;厂商为何需要在DVP确认漏洞已修复？</h3>

              <p>
                &nbsp;为了提高区块链整体的安全性，共同构建更好的区块链生态，厂商修复漏洞后，需要发邮件给DVP，告知漏洞已修复。或注册DVP账号，在漏洞管理里将漏洞状态改为已修复。
              </p>

              <h3>14.&nbsp;风险厂商是什么？</h3>

              <p>
                &nbsp;为进一步提升区块链行业各方对安全的重视，加强区块链生态安全。DVP郑重推出区块链风险厂商排行榜，通过漏洞等级及漏洞影响，提示行业相关安全风险，并对风险系数高且不修复的漏洞厂商进行负责任披露。
              </p>

              <p>
                &nbsp;DVP将对接收、审核过的区块链行业及合作企业存在的漏洞进行量化评估，根据漏洞情况在一定模型下建立评分制度，同时根据情节轻重对其存在的风险进行分类及细化说明，帮助投资者等各方更清晰地了解区块链相关企业或项目方的“健康状况”。
              </p>

              <h3>15.&nbsp;密码忘记怎么办？</h3>

              <p>
                &nbsp;请妥善保存账号密码，DVP作为去中心化平台，以区块链的机制运作，不支持找回账号和密码（私钥）。
              </p>

              <!--白帽子相关-->

              <h2>白帽子相关</h2>

              <h3>1.&nbsp;漏洞审核流程及周期是什么？</h3>

              <p>
                1
                &nbsp;白帽子提交漏洞后将由DVP专业审核人员进行漏洞分析验证，核实确认漏洞信息。核实验证后会进行漏洞确认并定价。但鉴于漏洞核实过程的复杂程度以及获得并配置目标环境的难易程度，审核时间通常为3-7天，特殊情况会延长审核时间。
              </p>

              <h3>2.&nbsp;如何提高漏洞审核通过率？</h3>

              <p>
                &nbsp;提交漏洞的时候务必按DVP提供的模板提交，不可删除模板，否则会予以驳回。相关文字描述、截图都需要尽可能完整，而且需以实际危害为导向，尽可能将危害最大化并证明出来，这样不但能一次通过审核，还能获得更高奖励。
              </p>

              <h3>3.&nbsp;漏洞奖励申请提现多久能到账？</h3>

              <p>
                &nbsp;DVP通过虚拟币转账的方式进行漏洞奖励支付，一般在认领漏洞后的7个工作日内。钱包地址必须真实有效。
              </p>

              <h3>4.&nbsp;为什么显示提现成功，但是我并没有收到？</h3>

              <p>
                &nbsp;目前所有奖励是基于以太坊网络，因为以太坊网络目前状况比较拥堵，导致转账缓慢，或者会出现交易广播未发出的情况，如存在该情况，请邮件联系我们，带上tx记录以及具体额度。
              </p>

              <h3>5.&nbsp;漏洞重复被提交，怎么办？</h3>

              <p>&nbsp;当收到多个白帽子提交相同的漏洞时，DVP以时间排序为准。</p>

              <h3>6.&nbsp;如何进行漏洞查重？</h3>

              <p>
                &nbsp;DVP目前不支持漏洞查重。但如若出现漏洞重复，漏洞审核人员将在漏洞详情里说明重复的漏洞编号。白帽子可根据漏洞编号到漏洞动态页面进行验证。
              </p>

              <h3>7.&nbsp;如何知晓漏洞的处理过程？</h3>

              <p>&nbsp;需登陆DVP在漏洞详情页查看漏洞处理进展。</p>

              <h3>8.&nbsp;白帽子是否有处罚制度？</h3>

              <p>
                &nbsp;一经发现并证实白帽子违反社区协议后，对情节严重者做封号处理
              </p>

              <h3>9.&nbsp;如何解决争议？</h3>

              <p>
                &nbsp;在漏洞报告处理过程中，如果白帽子对流程处理、漏洞定级、漏洞奖励等有异议的，可以发邮件反馈或通过即时通讯联系在线工作人员及时沟通。DVP将按照漏洞报告者利益优先的原则与企业三方协调处理，必要时可引入外部安全人士共同裁定。
              </p>

              <h3>10.&nbsp;如何联系DVP？</h3>

              <p>&nbsp;DVP反馈邮箱：service@dvpnet.io</p>

              <p>&nbsp;DVP官方微信号: dvpnet</p>

              <h3>11.&nbsp;密码忘记怎么办？</h3>

              <p>
                &nbsp;请妥善保存账号密码，DVP作为去中心化平台，以区块链的机制运作，不支持找回账号和密码（私钥）。
              </p>

              <h3>12.&nbsp;漏洞提交数量是否有限制？</h3>

              <p>&nbsp;没有限制</p>

              <!-- <h3>13.&nbsp;在DVP平台中战队可以获得什么?</h3>

						<p><strong>1）战队入驻基金奖</strong></p>

						<p>知名战队入驻可获得5000 DVP入驻基金</p>

						<p><strong>2）战队月度战绩排行奖</strong></p>

						<p>
							No.1战队可获得50000 DVP月度奖金 <br>
							No.2战队可获得30000 DVP月度奖金 <br>
							No.3战队可获得10000 DVP月度奖金
						</p>

						<p><strong>3）月度最佳活跃战队奖</strong></p>

						<p>战队成员人均提交有效漏洞数量最高的战队可获得20000 DVP</p>

						<p><strong>4）常驻战队月度基金奖</strong></p>

						<p>战队成员月内提交有效漏洞数均达到2个及以上的即可获得5000 DVP的月度战队基金奖</p>

						<p><strong>备注:</strong></p>

						<div  class="jl_div">
						    <p>▪ 每个战队成员数量原则上不超过10人，不低于3人</p>
						    <p>▪ 战队月度战绩排行以战队成员当月提交漏洞获得的总声誉值排名</p>
						    <p>▪ 新建战队需称号在黄金矿工级别以上，知名战队可直接入驻</p>
						    <p>▪ 战队月度战绩排行奖、月度最佳活跃战队奖的候选战队需成员平均提交有效漏洞数在6个及以上</p>
						    <p>▪ 战队月度战绩排行奖、月度最佳活跃战队奖、常驻战队月度基金奖，每月统计每月发放</p>
						</div> -->

              <!--DVP相关-->

              <h2>DVP相关</h2>

              <h3>1.&nbsp;DVP介绍</h3>

              <p>
                1 &nbsp;DVP全称是Decentralized Vulnerability
                Platform（去中心化漏洞平台），是全球首家以去中心化的漏洞平台。DVP社区作为一个去中心化的自治组织，全方位多维度贯彻执行漏洞的负责任披露，同时作为白帽子与厂商的核心纽带，为区块链厂商用户搭建高效、透明的安全信息平台。提升区块链整体的安全意识，共同构建更好的区块链生态。同时DVP社区将为区块链行业生态安全提供公益性的平台服务，白帽子可以进行威胁信息收集，帮助厂商发现安全威胁，同时提交信息的白帽子将获得相应奖励，努力实现区块链厂商与白帽子双赢的良性循环。
              </p>

              <h3>2.&nbsp;关于去中心化</h3>

              <p>
                &nbsp;DVP不会存储及对外公布白帽子个人联系方式，仅体现ID、擅长能力等。同时也不会公布厂商的联系方式等信息，仅体现厂商ID、悬赏计划等。目前DVP第一阶段以中心化的方式运作，但是运作方案会逐渐朝着去中心化的机制开展，最终发布自己的安全公链，达到真正的去中心化设计，具体可以参考官方<a
                  href="https://dvpnet.io/doc"
                  >[白皮书]</a
                >
              </p>

              <h3>3.&nbsp;DVP自治社区介绍</h3>

              <p>
                &nbsp;为了和谐且高效的链接厂商和白帽子，进而构建更安全的区块链生态，DVP基金会将打造DVP为自治性社区，并作出以下规划：
              </p>

              <div class="jl_div">
                <p>第一阶段：成员招募与生态打造</p>
                <p>第二阶段：权力下放</p>
                <p>第三阶段：社区自治</p>
                <p>
                  详情查看<a
                    href="https://github.com/dvpnet/Community/blob/master/README.md"
                    >[DVP自治社区计划]</a
                  >
                </p>
              </div>

              <h3>4.&nbsp;如何成为DVP自治社区成员？</h3>

              <p>
                &nbsp;DVP基金会在社区的GITHUB（github.com/dvpnet）上分发社区任务，并给出任务奖励（即贡献值），DVP生态体系（包括但不限于白帽子、安全厂商、入驻厂商等）完成任务将获得相应的贡献值。当贡献值大于0时，即可成为社区成员。
              </p>

              <!--DVP Token相关-->

              <h2>DVP Token相关</h2>

              <h3>1.&nbsp; DVP Token定义</h3>

              <p>
                1 &nbsp;DVP
                Token是DVP生态系统网络内唯一被接受的货币。永不增发，目前任何DVP网络的支付，悬赏，押金质押，必须用DVP币结算。DVP币支付用于奖励社区成员，为他们提供资金流动。
              </p>

              <p>&nbsp;总量：5,000,000,000</p>

              <p>&nbsp;符号：DVP</p>

              <h3>2.&nbsp;DVP Token用途</h3>

              <p>&nbsp;用于厂商发布悬赏的押金；</p>

              <p>&nbsp;用于支付漏洞奖励；</p>

              <p>&nbsp;用于维持生态运营，如开发，宣传推广等奖励；</p>

              <h3>3 .&nbsp;ERC20设计说明</h3>

              <p>
                &nbsp;支持锁仓：按照白皮书中设计的代币分配将一定量的代币进行锁仓，按季度等额释放。
              </p>

              <p>
                &nbsp;权限弱化：代币中设有owner账户，但是owner账户只有暂停交易的特权（主网上线后使用），无法对用户资产造成任何影响，杜绝单点威胁。
              </p>

              <p>
                &nbsp;高度安全：代币合约已经经过了多家专业区块链安全公司审计并加固，具有极高的安全强度。<a
                  href="https://github.com/dvpnet/DVP-TOKEN/blob/master/DVPToken_contract_audit_report.pdf"
                  >[DVPToken智能合约审计报告]</a
                >
              </p>

              <p>
                &nbsp;总量恒定：DVP
                Token没有设计代币销毁/增发功能，所以代币的总量是固定的。
              </p>

              <!-- <h3>4.&nbsp;社区奖励部分</h3>

              <p>
                &nbsp;“漏洞即挖矿”机制，每笔悬赏项目，需要存入50,000$等值的DVP平台担保金。每笔漏洞支付将回收10%形成DVP基金，将在每个自然月的最后一天00:00进行结算，其中DVP基金中当月80%用于奖励回馈社区所有持DVP
                Token用户，20%用于再次奖励平台当月按照漏洞提交数量排名TOP100的白帽子用户。
              </p> -->
            </div>
            <!--/span-->
          </div>
          <div style="clear: both"></div>
        </div>
      </div>
    </el-col>
  </el-row>
</template>

<script>
import "@/assets/jquery-ui-1.9.1.custom.min.js";
import "@/assets/jquery.tocify.js";

export default {
  name: "faq",
  data() {
    return {
      lang: "zh",
    };
  },
  mounted() {
    this.lang = localStorage.getItem("locale");
    if (this.lang == "zh") {
      this.$router.push({ path: "/faq" });
    } else if (this.lang == "en" || this.lang == null || this.lang == "") {
      this.$router.push({ path: "/faq_en" });
    } else if (this.lang == "ko") {
      this.$router.push({ path: "/faq_ko" });
    }

    $("#toc1")
      .tocify({
        selectors: "h2,h3,h4,h5",
      })
      .data("toc-tocify");
  },
  destroyed() {
    $(".faq1").html(" ");
  },
};
</script>

<style>
</style>
