<template>
  <el-row :gutter="20">
    <el-col :span="24" style="padding: 0 !important ; float: inherit">
      <div class="container-fluid">
        <div class="row-fluid">
          <!--left-->
          <div class="span3">
            <div id="toc2"></div>
          </div>
          <!--right-->
          <div class="span9 faq2">
            <div class="hero-unit">
              <h1>FAQ</h1>

              <h2>공급 업체 관련</h2>

              <h3>1.&nbsp;DVP를 선택하는 이유는 무엇입니까?</h3>

              <p>
                &nbsp;전통적인 보안 서비스 제품은 주로 자동으로 보안 문제를
                확인하는 데 사용되며 제한된 적용 가능성을 가지고 있습니다. DVP
                커뮤니티에서는 전 세계의 화이트 해커 및 보안 엔지니어가 공격자의
                논리에 따라 업체의 보안 문제를 테스트 및 탐지하고 결함 경고 및
                긴급 대응 메커니즘을 개선하며 블록 체인 업계의 전반적인 보안을
                향상 시킵니다.
              </p>

              <h3>2.&nbsp;DVP를 어떻게 사용합니까?</h3>

              <p>&nbsp;먼저, 계정을 등록하고 신원 확인을 통과하십시오;</p>

              <p>
                &nbsp;둘째, 보증금을 지급하고 결함 보상 계획을 발행하십시오;
              </p>

              <p>&nbsp;셋째, DVP 플랫폼에 있습니다.</p>

              <h3>3.&nbsp;DVP 계정을 등록하려면 회사 이메일이 필요합니까?</h3>

              <p>
                &nbsp;예. 신원 확인 및 향후 결함 게시에 사용됩니다. 이 이메일은
                공개적으로 표시되지 않습니다.
              </p>

              <h3>4.&nbsp;계정을 등록한 후 DVP 플랫폼에 있습니까?</h3>

              <p>
                &nbsp;아니요, 두 단계 더 필요합니다 : 보증금을 지급하고 결함
                보상 계획을 발행하십시오. 이 두 단계를 완료하면 DVP 플랫폼을
                사용하게 됩니다.
              </p>

              <h3>5.&nbsp;보증금이란?</h3>

              <p>
                &nbsp;장래의 결함 보상 비용이 원활히 지급되기 위해 공급 업체는
                최소 높은 위험 레벨의 버그에 해당하는 보상금액보다 크거나 같은
                금액을 보증금으로 입금해야 하며 보증금은 언제든지 환불이
                가능합니다.
              </p>

              <h3>6.&nbsp;화이트 해커란?</h3>

              <p>
                &nbsp;화이트 해커는 컴퓨터 또는 네트워크 시스템의 보안 결함을
                식별할 수 있는 보안 전문가이지만 해커와 달리 결함을 악용하지
                않고 공급업체 또는 제 3 자 결함 보고 플랫폼에 문의하여
                공급업체가 결함을 수정하고 전체를 향상시키는 데 도움을 줍니다.
              </p>

              <h3>7.&nbsp;결함 보상금의 금액을 누가 결정합니까?</h3>

              <p>
                &nbsp;현재 결함의 심각성에 따라 전문적인 결함 감사원이
                결정합니다.<a href="#" class="Vul_rewardReference"
                  >[커뮤니티 보상 기준]</a
                >을 참조하십시오
              </p>

              <h3>8.&nbsp;누가 결함 보상금을 지급합니까?</h3>

              <p>
                &nbsp;결함에는 DVP 플랫폼의 공급 업체와 DVP 플랫폼을 사용하지
                않는 공급 업체의 두 가지 유형이 있습니다. DVP 플랫폼의 공급
                업체는 보상금을 지급하고 지적 재산권을 소유하며 결함에 대한
                정보를 게시할지 여부를 결정합니다. DVP 플랫폼을 사용하지 않는
                공급 업체의 경우 DVP는 공급 업체가 결함을 처리할 수있는 7 일을
                부여하고 7 일 후에 DVP 기금이 보상금을 지급하며 DVP 커뮤니티는
                결함을 공개적으로 처리할 수 있으며 수정된 경우 자세한 정보
                (그러나 민감한 내용은 모호함)를 발표할 것입니다.
              </p>

              <!-- <h3>9.&nbsp;DVP는 무료입니까?</h3>
						
						<p> &nbsp;DVP는 완전히 무료입니다. 공급 업체의 모든 보상금은 화이트 해커에게 사용합니다</p>			 -->

              <h3>9.&nbsp;결함을 처리하는 방법이 무엇입니까?</h3>

              <p>
                &nbsp;공급 업체는 먼저 등록해야 하며 결함을 확인하고 처리할 수
                있습니다.
              </p>

              <div class="jl_div">
                <p>엔터 프라이즈 취약점 처리 운영 과정:</p>
                <p>
                  1) 회사 우편함을 사용하여 등록함(회사 우편함이 없는 경우 일반
                  우편함으로 등록함)
                </p>
                <p>2) 신원 확인 (일반적으로 1 ~ 3 일 내에 완료될 수 있음)</p>
                <p>3) DVP에 로그인하기</p>
                <p>4) 공급 업체 계정의 결함 확인</p>
                <p>
                  5) 결함 세부 정보를 확인한 후 클릭하여 결함을 처리할 수 있음
                </p>
              </div>

              <h3>10.&nbsp;보상금을 지급하는 방법이 무엇입니까?</h3>

              <p>
                &nbsp;보증금을 지급한 후 공급 업체는 보상금 관리 페이지를 보고
                보상금 계획을 편집할 수 있습니다. 계획에는 다음과 같은 내용이
                포함됩니다:
              </p>

              <div class="jl_div">
                <p>1）보상금 계획</p>
                <p>2）시험 범위</p>
                <p>3）결함 위험도</p>
                <p>4）메모</p>
              </div>

              <h3>11.&nbsp;결함 정보가 공개되어 있습니까?</h3>

              <p>
                &nbsp;결함이 고쳐지면 DVP는 일부 전형적인 결함을 선별적으로
                게시할 수 있지만 민감한 세부 정보를 숨길 수 있습니다
              </p>

              <h3>12.&nbsp;DVP는 결함을 수정해야 합니까?</h3>

              <p>
                &nbsp;DVP는 결함 수정에 대한 책임이 없지만 고객센터에 문의하여
                도움을 받을 수 있습니다.
              </p>

              <h3>
                13.&nbsp;공급 업체가 복구된 결함을 DVP에서 확인해야 하는 이유는
                무엇입니까?
              </h3>

              <p>
                &nbsp;Blockchain eco 시스템의 전반적인 보안을 향상시키려면 공급
                업체가 결함을 처리한 후 이메일을 보내고 DVP에 알리거나 DVP
                계정을 등록하고 결함 관리 상태 페이지에서 결함 상태를
                '복구됨'으로 변경해야 합니다.
              </p>

              <h3>14.&nbsp;위험한 공급 업체란?</h3>

              <p>
                &nbsp;DVP는 업계에서 블록 체인 보안에 더 많은 관심을 기울일 것을
                요구하면서 위험한 공급 업체 순위를 게시합니다.이 사이트에서는
                위험이 큰 결함을 처리하지 못한 공급 업체를 나열합니다.
              </p>

              <p>
                &nbsp;DVP는 블록 체인 업계와 공급 업체를 순위 지정하는 정량적
                분석 모델을 보유하고 있으며, 투자자가 블록 체인 에코 시스템의
                건강 상태를 이해할 수 있도록 결함 위험 수준에 대한 자세한 설명을
                제공합니다.
              </p>

              <h3>15.&nbsp;비밀번호를 잊어버린 경우 어떻게해야 합니까?</h3>

              <p>
                &nbsp;비밀번호는 안전한 장소에 저장하십시오. DVP는 분산된
                플랫폼이며 블록 체인 규칙을 따르므로 손실된 계정 / 비밀번호
                (프라이빗키)를 다시 찾을 수 없습니다.
              </p>

              <!--白帽子相关-->

              <h2>화이트 해커 관련</h2>

              <h3>1.&nbsp;결함 심사의 일정과 절차는 무엇입니까?</h3>

              <p>
                &nbsp;화이트 해커가 결함을 제출한 후 DVP 전문 감사인은 결함
                정보를 감사하고 확인하고 가격표를 제공합니다. 감사 및 분석
                절차가 어렵기 때문에 감사 시간은 3 일에서 7 일 사이가 될 수
                있으며 경우에 따라 길어질 수 있습니다.
              </p>

              <h3>2.&nbsp;결함 제출의 합격률을 높이려면 어떻게해야 합니까?</h3>

              <p>
                &nbsp;DVP 템플릿을 사용하여 결함을 제출하거나 템플릿을 삭제하지
                마십시오. 제출이 거부됩니다. 관련 텍스트와 그래프는 결과와
                결함의 증거로 완전해야 하므로 제출이 처음 감사를 통과할 수
                있으며 더 나은 보상을 얻을 수 있습니다.
              </p>

              <h3>3.&nbsp;결함 보상금 요청 대기 기간은 얼마나 됩니까?</h3>

              <p>
                &nbsp;DVP는 결함이 처리된 후 7 일 이내에 암호 통화로 보상금을
                지급하고 지갑 주소가 유효해야 합니다.
              </p>

              <h3>
                4.&nbsp;보상금을 지급하였다고 해도 보상금을 받지 못 했다는
                이유가 무엇입니까?
              </h3>

              <p>
                &nbsp;현재 모든 보상은 Ethereum 네트워크를 통해 지급됩니다. 에테
                리엄 네트워크에 트랜잭션이 느려지거나 브로드 캐스트 오류가
                발생하는 경우가 있습니다. 이 경우 거래 기록과 금액을 이메일로
                보내주십시오.
              </p>

              <h3>5.&nbsp;결함이 두 번 제출되면 어떻게 됩니까?</h3>

              <p>
                &nbsp;반복된 제출물이 접수되면 DVP는 제출된 첫 번째 제출물을
                선택합니다.
              </p>

              <h3>6.&nbsp;결함이 반복되는지 확인하는 방법은 무엇입니까?</h3>

              <p>
                &nbsp;현재 DVP는 반복된 제출 확인을 지원하지 않습니다. 반복되는
                제출물이 있는 경우 감사인은 반복 ID를 결함 정보에 넣고 화이트
                해커는 결함 ID를 사용하여 결함 상태 페이지를 확인할 수 있습니다.
              </p>

              <h3>7.&nbsp;제출 및 처리 상태를 확인하는 방법은 무엇입니까?</h3>

              <p>
                &nbsp;취약점 처리 상태를 확인하려면 DVP 취약점 정보 페이지에
                로그인하십시오.
              </p>

              <h3>8.&nbsp;처벌에 대한 역할이 있습니까?</h3>

              <p>
                &nbsp;커뮤니티 규칙을 위반하는 경우 위반자 계정을 사용 중지할 수
                있습니다.
              </p>

              <h3>9.&nbsp;불일치를 해결하는 방법이 무엇입니까?</h3>

              <p>
                &nbsp;결함 처리 과정에서 화이트 해커가 절차, 결함의 심각성 또는
                보상금에 동의하지 않으면 DVP 온라인 회원 서비스에 이메일을
                보내십시오. DVP는 공급 업체 및 제출자와 협력하고 우선 순위는
                결함 제출자에게 갑니다. DVP는 필요할 경우 독립적인 보안 전문가를
                소개해줍니다.
              </p>

              <h3>10.&nbsp;DVP에 연락하는 방법이 무엇입니까?</h3>

              <p>&nbsp;DVP 피드백 이메일 주소: service@dvpnet.io</p>

              <p>&nbsp;DVP 위쳇 아이디: dvpnet</p>

              <h3>11.&nbsp;비밀번호를 잊어버린 경우 어떻게해야 합니까?</h3>

              <p>
                &nbsp;비밀번호는 안전한 장소에 저장하십시오. DVP는 분산된
                플랫폼이며 블록 체인 규칙을 따르므로 손실된 계정 / 비밀번호
                (프라이빗키)를 다시 찾을 수 없습니다.
              </p>

              <h3>12.&nbsp;결함 제출 횟수에 제한이 있습니까?</h3>

              <p>&nbsp;제한이 없습니다</p>

              <!-- <h3>13.&nbsp;DVP에서 팀워크의 이점은 무엇입니까?</h3>

						<p><strong>1） 팀 등록 보상</strong></p>

						<p>엘리트 팀 등록 5,000 DVP</p>

						<p><strong>2）월간 리더 보드 리워드</strong></p>

						<p>
							우승 팀 50,000 DVP  <br>
							준우승 팀 30,000 DVP<br>
							3 위 팀  10,000 DVP
						</p>

						<p><strong>3）달 보상의 별</strong></p>

						<p>회원 당 최대 공인 결함 보고서를 보유한 팀 DVP 20,000 (평균)</p>

						<p><strong>4）월간 참여 보상금</strong></p>

						<p>두 개 이상의 공인된 결함 보고서를 보유한 팀 5,000 DVP</p>

						<p><strong>비고:</strong></p>	

						<div  class="jl_div">				
							<p>▪ 각 팀은 3 명 이상 10 명 이하이어야 합니다.</p>
							<p>▪ 월간 순위표는 자격이 있는 결함 보고서를 제출하여 얻은 팀 평판 점수에 의해 순위가 매겨집니다.</p>
							<p>▪ 엘리트 팀을 등록하는 경우를 제외하고 새 팀을 등록하려면 "금 수준"이 필요합니다.</p>
							<p>▪ 월간 리더보드 보상 또는 달 보상의 별을 얻으려면 팀이 평균적으로 구성원 당 6 개 이상의 적격 결함 보고서를 보유해야 합니다.</p>
							<p>▪ 모든 월별 보상은 매월 계산되고 발송됩니다.</p>
						</div>
						 -->
              <!--DVP相关-->

              <h2 class="rule-item-title">DVP 관련</h2>

              <h3>1.&nbsp;DVP 소개</h3>

              <p>
                &nbsp;DVP는 Decentralized Vulnerability Platform의 약자로, 세계
                최초의 분산된 결함 플랫폼입니다. DVP 커뮤니티는 분권화된 자치
                단체로서 책임감 있게 결함 정보를 게시하고 블록 체인 공급 업체와
                화이트 해커를 조정하며 블록 체인 에코 시스템의 전반적인 보안을
                향상시킵니다.
              </p>

              <h3>2.&nbsp;분권화에 대해서</h3>

              <p>
                &nbsp;DVP는 ID 및 전문 분야 만의 개인 정보를 저장하거나 게시하지
                않습니다. 동시에 DVP는 공급 업체의 연락처 정보를 게시하지 않고
                공급 업체 ID 및 보상금 계획만 공개합니다. 첫 번째 단계에서는
                DVP가 여전히 중앙 집중화되지만 나중에 운영이 분산되어 결국
                자체적인 공공 블록 체인을 갖게 됩니다.<a
                  href="https://dvpnet.io/doc"
                  >[자세한 내용은 공식 백서를 참조하십시오]</a
                >.
              </p>

              <h3>3.&nbsp;DVP 커뮤니티 소개</h3>

              <p>
                &nbsp;블록 체인 공급 업체와 화이트 해커를 효율적으로 조정하고 더
                나은 블록 체인 시스템을 구축하기 위해 DVP 기반은 DVP를 자치
                커뮤니티에 구축할 계획이며 다음과 같습니다:
              </p>

              <div class="jl_div">
                <p>첫 번째 단계 : 회원 모집</p>
                <p>두 번째 단계 : 회원에게 관리 권한을 공개하기</p>
                <p>셋 번째 단계 : 지역 사회 자체 관리</p>
                <p>
                  자세한 내용은<a
                    href="https://github.com/DVPNET/Community/blob/master/README.md"
                    >[DVP 자치 커뮤니티 계획 1.0]</a
                  >에 살펴보시기 바랍니다
                </p>
              </div>

              <h3>4.&nbsp;DVP 커뮤니티 회원이 어떻게 되는 것입니까?</h3>

              <p>
                &nbsp;DVP 기반은 Github (github.com/DVPNET)를 사용하여 커뮤니티
                작업을 할당하고 작업 단어 (기여도 값)를 제공합니다. DVP 에코
                시스템 (화이트 해커, 보안 업체, DVP 플랫폼 공급업체를 포함하지만
                이에 국한되지 않음)에서 작업을 완료하면 기여도 포인트를 얻을 수
                있으며 기여도가 0보다 클 경우 DVP 커뮤니티 회원이 됩니다.
              </p>

              <!--DVP Token相关-->

              <h2 class="rule-item-title">DVP 토큰 관련</h2>

              <h3>1.&nbsp;DVP 토큰이란</h3>

              <p>
                1 &nbsp;DVP 토큰은 DVP 에코 시스템에서 유일하게 허용되는
                통화이며 총 금액은 고정되어 있습니다. DVP 네트워크의 모든 지급,
                보상, 보증금은 DVP 토큰을 사용하여 지급해야 합니다. DVP 토큰은
                커뮤니티 회원들에게 보상하거나 그들에게 유동성을 제공하는 데
                사용될 수 있습니다.
              </p>

              <p>&nbsp;총 금액 : 50 억</p>

              <p>&nbsp;심볼 : DVP</p>

              <h3>2.&nbsp;DVP 토큰 사용</h3>

              <p>&nbsp;공급업체 보상의 보증금으로 사용할 수 있습니다</p>

              <p>&nbsp;결함 보상금을 지급하는 데 사용할 수 있습니다</p>

              <p>
                &nbsp;커뮤니티 개발 또는 홍보 이벤트와 같은 커뮤니티 유지 보수에
                대한 보상에 사용할 수 있습니다
              </p>

              <h3>3 .&nbsp;ERC20 설계 설명</h3>

              <p>
                &nbsp;지원 토큰 잠금 : DVP 토큰의 일부는 DVP 백서에 따라 잠기고
                분기별로 릴리스 할 수 있습니다.
              </p>

              <p>
                &nbsp;약화된 권한 : DVP 토큰은 소유자 계정을 가질 수 있지만
                트랜잭션 일시 중지 권한만 있으므로 사용자 자산에 영향을 미치지
                않으므로 단일 지점 오류는 발생하지 않습니다.
              </p>

              <p>
                &nbsp;높은 보안성 : DVP 토큰 계약은 여러 전문적인 블록 체인 보안
                회사의 감사를 거치고 통과했으며 매우 안전합니다.
                <a
                  href="https://github.com/DVPNET/DVP-TOKEN/blob/master/DVPToken_contract_audit_report.pdf"
                  >[DVP 토큰 스마트 계약 감사 보고서]</a
                >
              </p>

              <p>
                &nbsp;고정된 금액 : DVP 토큰의 총량은 고정되어 있으며 토큰 삭제
                / 재발급 기능이 없습니다.
              </p>

              <!-- <h3>4.&nbsp;커뮤니티 보상</h3>

              <p>
                &nbsp;결함은 마이닝 풀 메커니즘입니다. 모든 보상 프로젝트는 $
                50000 DVP 플랫폼 보안 보증금을 지급해야 합니다. 결함 보상금의 10
                %는 DVP 기금에 전달됩니다. 매월 마지막 날에 DVP 기금 수입 가운데
                80 %가 모든 DVP 토큰 소지자에게 돌아가고, 20 %는 그 달의 가장 큰
                결함 제출자에게 갑니다.
              </p> -->
            </div>
            <!--/span-->
          </div>
          <div style="clear: both"></div>
        </div>
      </div>
    </el-col>
  </el-row>
</template>

<script>
import "@/assets/jquery-ui-1.9.1.custom.min.js";
import "@/assets/jquery.tocify.js";

export default {
  name: "faq",
  data() {
    return {
      lang: "zh",
    };
  },
  mounted() {
    this.lang = localStorage.getItem("locale");
    if (this.lang == "zh") {
      this.$router.push({ path: "/faq" });
    } else if (this.lang == "en" || this.lang == null || this.lang == "") {
      this.$router.push({ path: "/faq_en" });
    } else if (this.lang == "ko") {
      this.$router.push({ path: "/faq_ko" });
    }
    $("#toc2")
      .tocify({
        selectors: "h2,h3,h4,h5",
      })
      .data("toc-tocify");
  },
  destroyed() {
    $(".faq2").html(" ");
  },
};
</script>

<style>
</style>
